#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "1be2ceca41c24b1d31bc89b0ca9dac3e" -> "91c700adf1e43387395906217a142e47"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "16dfc042ec782f0a4d72e82cbce58cc4" -> "68bc71be6994e9879e5f5ff0de2f3dab"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "b7ea9969ef58cd53a7835364208bc0c3" -> "7f83a936911a9baf45a535ce92697775"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "8b77a1f7ad6d7c4cb05c2e4e27836f40" -> "7aa281e36fe41209f88a9039d567b4d7"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "d76f9645b23236689e01c6c9c572990f" -> "6c8d586d232e23dbd9c6129e3af2a103"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "40fce44b33d2c097b6032055432403ec" -> "a678f5a0ddce67574cea49c2b72efe1d"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "71191a0425eecc6bef1db49db322db55" -> "4e822fda4d206615e09dbfceab046c89"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "3bb2da7aaf36e5729c4650baf175ef3b" -> "85b53eab5729951dca917d2d5fb68af7"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "65ac27e75ac4e7261107a069b038abb0" -> "e415841f9fc4fbbebcaab9b5928ff0d2"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "918ce52f115e0fa20ce83d3836207c09" -> "d7edceadab8bec74c3c3f7e5e4c5626a"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "662c357a85af01a4379cf4811cb2e3c2" -> "72ca7053962015e22198a6993ef03690"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "523b770bf07e08503e81c3f6087f2d13" -> "d822d7ed3b34212943fe9fa7605f986e"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "68f88a9745e8ccb30b01b0862f56f9c8" -> "3e9ae086ab008802f8afda5d3753e602"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "0b059ca8536ea2b111978a90b4b2b174" -> "30aed8dbbba9447fe205feb4f6afec78"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "1f4320e070a8a3552f7839143541eea6" -> "5c81f70b07e36a30ea6da7a07b09502a"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "4f09a0cd7e8c7f060e49f35daea9a1c7" -> "d7a58c728d1c66650921b9162acc57ba"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "f0e54b9bca3aae4576b7748be4118fba" -> "d56828a53f152648bcaadb951d348b43"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "cd5ef6e0a70212640df3816710309106" -> "9bb3887da195e85d00b61de2571c8884"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "e8c02a3806e3a7a38bc5c1b9245824fe" -> "84b3eb34c5cdb47d9872070ff6bd6a7d"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "6f6404e590ca7329c291bbd7ca9c2e2e" -> "b9e2f5c72a60e128fd4b9ec3b962375f"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "aefe28017c94058c5306e7846eb5b85b" -> "c910d4990fe04ebd125b0a1dc4c068d1"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "183bd6c28c286b1a75581b42aff2efea" -> "1e85fc1262689978a4cc8d1b2ba05476"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "3475c3b0460254e891944e4bd5d55d2d" -> "7eeecab82f3863f120fbb569c96fd41e"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "a50652519174bd99ef07ce317e3e7aa8" -> "ac464418a6e30df7d2f379e9bffe943d"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "b7905316d2adcd45c87b61c9fcdc2308" -> "78ec95745ba46d682ac6d2db7db3dad9"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "9c75d1b2e3cc5dd7e76eb81ee20921a0" -> "0478e02011104eeaa2b948743c88868c"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "7f66e3ef6f41617d8712a3ddc21cada7" -> "4a269b692c506c5bb294b7c2b690b182"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "5b4f81992f27b3a31960aa618a2f3ecc" -> "b8f1f782632829394cac6e0829aa16d2"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "2bc42e1871125963d734eac22fed0225" -> "796e9f141ff177a28e35f3e8c60200a4"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "4ad227eb3e74a85574d3b54699ac421c" -> "ff90c522fd0eabbd6f3e2ad87008e108"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "fc00a560b243e84c99e609eacdc40677" -> "eb4c59ac3a42099011df419e8466cfb7"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "42ca2fb692552bf2775aef3e54f1236c" -> "c68bbeca9511bb3379a556e6e5e3d843"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "c26f8703675c3928dd1ec38c411e852a" -> "3270d58ccf5c7fedf6d7157968b1b86e"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "f0cf3cb7f2ef475fcb6f24a7ead92574" -> "a1b8b6b43f56956493bb3583fbfa173e"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "1c5f3a44581789f39a86322b471f4bf5" -> "6591465e890d7738a3f03dfbdf81752d"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "02cd987236dcb82ad3132368a7ad922a" -> "356472fb09a4e1539ca5b47c1598c5de"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "b0250ce808ed4e3417c67728e91a6135" -> "11622888ce8da255d8acd9aebc58a00d"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "9cf4711f41c324d42b88b55538569865" -> "8e0110266a39ec58a718481297671337"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "baf5556041fa35d121ff5d23df01a9e8" -> "6d3270adfbe0a338e8d140e714e5fd36"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "80deeff267036c7db43c2231f7ed0655" -> "e3ff834872a34d23ac2705c2292be160"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "3227dc25a31564a1bf949811d978f518" -> "db5e7485bec7089f02052d8e45c1b458"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "dbc043a7e7081aefb875a88dee8b9ea5" -> "4b5b56ab94b8137225d1716860e6ff26"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "L0l9w/LUOnAPWeRWWpFGqYRSCM4x4ZbSFG2+sSGWfGE=" -> "PCERi+iqC0tmtJU44gSvckKTJ3gW4FVavM2amnWg/U0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-10-17T19:16:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "ouO1/siMWws+Tg/UVNTFy5pvkoNcBC1e47GJFAKpS/U=" -> "RdqBeyTqEHwCsWpwJXlaZ2qxsgL+wXj8agtQx5B1bfA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:29.815+0000" -> (known after apply)
      ~ source_code_hash               = "9b3Aoay3AHTLFekjpOIQlYNPuHlqUUPMUjLrekgqUOM=" -> "kH1ZGq9JfeelpEeBN/XdZSOTLmWXEW14VOabR+NMAS0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "zJnuuxEd53dB+c02lrQzKbxxVV91bzbEh6SxTO3K6RM=" -> "erj2zmzwZ/BfUqmRpynaKU6wqzX6EPWqxGbBvoXwCtE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "m5PqWZaAB/3Ipw8SJLO6ROAPky+twfdXXVXEXmgRrNk=" -> "eBPHi9hB4rkZHWJmjZ2SaVeP3YN7NjCp+PZlXR6EPpw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-10-17T19:16:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "AXxEalKVwy/Lq2S3TEElM+Z8UE+3kIU9nEr8Hvb2fqU=" -> "Qvk1XDLU4p0nbQlr4Q8Rle8ebOl708GoksT/sOT66UI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "ueXTXYAcQZNfvoEm/kFTjCmdc8AoEEZszXhn7xlmWCM=" -> "kwEr7QN1UhR1Z4ZWNCstyo+4foGVUnChSD1H94bjnzs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "EDu+4Xbfd16SVRTcGbd3erYMQbgN/mgikTP7H1OZz3w=" -> "GBqC94f2o4Cmw/ei/Xjt8k48RzejCHQ8exu88fFTKVw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "NRGIpMvuI2g/jHxC02dHKIpAQsOVa+ED8pTGerDI+o0=" -> "ohUqxsvnXzzYm3XBkmNBDq1pCYtCHmXh0FlqZ8eaKPk="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZT17nljKBhsGiExXynfaZcOlwC+bBnd+/SVUqwY1v94=" -> "ZlHePWU1s1IjEk0gBCiKuPDZx0A6RFg1LJCdNuC5BXc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "Iqq3YckCBN0WTAtINnlMSzmGtFvJjwvBG1BWzY5MePE=" -> "Vc/zxzZqlNgNNeRVg1TkHa5LdOFp/cFOk2evFFAeJU0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:29.048+0000" -> (known after apply)
      ~ source_code_hash               = "s7zR0z9POPE/e6j63GBOZ1JNa/w4xZ/nQ8RGuHQ4LPs=" -> "Na+0Hnm33mfSvVQuFceKtzaQqUkGQ0j3KA6yjP+yaJ4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "Bhqb6ui6BcwO5wPIuNKjsOdGg4tTVY0v0j2ksFDDK5E=" -> "597gLJipNfQPDe4rGH6msVg7IZUmcG3QuXjn+oNl7pA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-17T19:16:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "kbJTwmQpfn9OQ7v7xf6yMWPJtogJJ8huk6uLy1p0k6g=" -> "Uz9AMuZqL2J/FupHMMFqZgweksVK4xD65mwcvK7jYHs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-10-17T19:16:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "bBz9iKqFXZ5oGZfuctRZP+/DVQWYeaFjrgFSBsqVftU=" -> "htacgEIIkd38xkeRN/cmuBiWxes7XRh0qwqKAFZn/bo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "yfG18UnEa8Si3yD0RVGEUQmCVjAFg7JL5oayJrdszVE=" -> "jWOWxU/5ltibhn7klwXLZ5YqJMLXFaT0VDyor+d5Lyk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-10-17T19:16:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "Q+ATtGUM4Ycsp7xBbqMlRHnTarlV29hPLUWQx6wdywQ=" -> "Y8Gglxdm40PDVFBviVw+M9owiTpVUBQ7WccFFKJHGDE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "NEWix2wfCHWigp/rGPp6MzQ2xDQUBbT78NQr8KfEtOw=" -> "GqCADd1wbbB8vCUvt9YTw+7K7hcIvy/3NQabIG0HrUI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "AS++zzwQBkvk5Yj6qiEVa41By26MKRNb3+zkjzy4kw0=" -> "0e+qkCKNiBijVVQMjQfLVmmcuny9Z0l8okNhKZ0COSg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "m6HPI0pYQ3CGOsvKL23013faUx0I7EcAYVjWvuY4IxM=" -> "adLD21K4ytPmeC55hohJvW96d7FFl42DccquGOCy1b8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-10-17T19:16:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "RRwQXcrQNgZ3Jv3Ylaa7OOoimSEplV+p1oSzjNNryH8=" -> "p9PmgwLhGZl88kEPy5b3q1wxsuQ8CJPtmTUuOuqHMZY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "2ROWm3jLGrAeB4xiiwfnewdjPxgghOyYL9AwaaNCpq8=" -> "aT18kW/MgEM5ccf9Wns4So0ExGP+PZVTpN35VdfaCRA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "wKepvwT6jx+NoQaT7az9pkS66R62lPlK1ls7KFoQ86s=" -> "MjyLM5XJw3Dijpy6d1JcPPzBL/RuhUWk+5mEkQI+fBs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "iXwcJx1xH58F2KKBFhrWAfCa36T/zQaUanSbHXtLtbc=" -> "+LSQbjVmOF1oI6KjPdt9aZASle4fSuV7E1sFGWtJa2k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-10-21T13:35:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "rKQcG01bI6YvaBvJPxyl32MJ4pm1nAo7LqSe6PC0U0Q=" -> "jHRBvg+Dwa/W7s3vFpv/LPoGfvgBRVJDLJJrYWGo4l0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "VOC80MSGwSZKu90RT5+fRGWKOmlWMvHlGapRkhH0kq8=" -> "eD5ZGL0ro9SxRmaey9g8oRfZrFLflKyheC3+G7+zTzE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "xfq8hNaBTvHxwpjno1kUX/dghIzLSU7OAVm/EYxU2H4=" -> "2otzW+WhtB8KqpFuq2c9lqWR12DrCgOUmbuH+K2Druw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-10-17T19:16:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "yDbtUTMXcav1JJqHsKNV7N2byCXIX9A/hs47cD7pqvU=" -> "kHrZFsfxo+O9y1szOnQgc6jFkZd3tU5VSpIzojFar4g="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "ct8Vvxdpr5Mm1v+3X0qCLmj0QJAQJwnH3H2JENv1S9g=" -> "75alfAaEhVFNKqEfakHmAfmTitKsj8JiZr1rZigY5Ag="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2022-10-19T15:40:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "n74A2nSqUnbScU2OG0plV3z2LBL51s7P40/6RnPKhQ4=" -> "ysjgmdrBGIfusrEyi+lkR4oyu/Do8A40v+PNsdVZ5Ns="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-10-17T19:16:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "y9CAh/eiSIb/4eBz5rwF1eWLhB1ul1Eftv65+IsK7mA=" -> "mgF4vOCYTKH4cltTV9psZkVAw5si85xuPXNRJTrRzF8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "nmgbEClnpQn/8CBpIlvglCfU/JCMtDxpRA9F+1tX3cs=" -> "q8VyY1m7+e+bQ/XEds2MOYSUiiDkK+mlufJiRYdAyqo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "UnAykZq0oRSsaGuNp/DZAa1Juu48M77k1tvyjlStUF8=" -> "Zw9Gr535KaLE4gE4nqRQuiiLZrR+XJUxATVbtFvkylo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "TII9KzTL8kfjQR5CsuEKJmtjTi1AbB0NFdOdeE3E2ro=" -> "zd05rYxtDxEfAmaveBc0FsrKYbO2o+ly/alGlWT/Gms="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "6vBYkANzSSZEHvwiB8r/0NS6gzPuM86Ak82CDbYg9Fs=" -> "yp3gTbpuWvOBgTYfoZhBlqfCstm/vkyGqrDILSrCk7g="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "OQBGmlhxzLK9d1hMB76DGXN8MYWFCwVqed1M1INrKvQ=" -> "MtA2/fHeVXT5wbzvLWppf1hZsffCSpHCWDnO6M1kpAg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "kBP0/pruva19T7CVoJttksFOnGdD9EKDj8M1owir46U=" -> "2NvJbTPF3loQsoyYwj1mrf8HYOy350BhWwyiL+q8gsE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:29.815+0000" -> (known after apply)
      ~ source_code_hash               = "qTTqw2sRQ53+Jn9C5+RTpJYm4xyDn8j364P3yzX3Wt0=" -> "Uftlh90sekNLqdJi5fMuHPtewWO8ICAyv3Qjnf2KKFM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "2AvEjneqTOWEZjdhnp8s8y4Gn7WgFRCVzKTHPspueug=" -> "you4woWmvioWGq4fTxmL/J1y5ePrTW5j5tX2/448OQc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "40zNJzZ19czzxc2OcYcLce7+ardm5BsZBRW36VuBKPY=" -> "eH32JKIP8XDZNvPpRq0pzhBBUQqGLmjwGc4OlguYnUY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "PWLIdkSRaYfWnrxkwDyZYeIlYMw5A04KnfQgaFKS0HE=" -> "9GDljF283gwAvz2ucjQlcipq9kJ0byKl6RFd5cAf9Ak="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-10-17T19:16:40Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "pgdiga" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-10-17T19:16:39Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-10-17T19:16:39Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 85 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @dsgarcia8, Action: `pull_request`*